; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	image1 - mode
	image0 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star2)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument3 image0)
	(calibration_target instrument3 Star2)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet13)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 image1)
	(calibration_target instrument7 Star3)
	(supports instrument8 image1)
	(calibration_target instrument8 Star1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet5)
	(supports instrument9 image0)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation4)
	(supports instrument10 image0)
	(supports instrument10 image1)
	(calibration_target instrument10 Star3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(supports instrument11 image0)
	(calibration_target instrument11 GroundStation0)
	(supports instrument12 image1)
	(supports instrument12 image0)
	(calibration_target instrument12 Star2)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet12)
	(supports instrument13 image1)
	(supports instrument13 image0)
	(calibration_target instrument13 Star3)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star9)
)
(:goal (and
	(pointing satellite0 Star6)
	(pointing satellite2 Planet11)
	(pointing satellite5 Planet13)
	(have_image Planet5 image1)
	(have_image Star6 image0)
	(have_image Planet7 image1)
	(have_image Phenomenon8 image1)
	(have_image Star9 image1)
	(have_image Planet10 image0)
	(have_image Planet11 image1)
	(have_image Planet12 image1)
	(have_image Planet13 image0)
))

)

; plan
1. (turn_to satellite2 planet11 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet11)
   goals met: 1 of 12
2. (turn_to satellite0 star2 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star2)
   goals met: 1 of 12
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 12
4. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 1 of 12
5. (turn_to satellite0 planet13 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet13)
   goals met: 1 of 12
6. (take_image satellite0 planet13 instrument0 image0)
   added: (have_image planet13 image0)
   goals met: 2 of 12
7. (turn_to satellite0 planet12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet12)
   goals met: 2 of 12
8. (take_image satellite0 planet12 instrument0 image1)
   added: (have_image planet12 image1)
   goals met: 3 of 12
9. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 3 of 12
10. (take_image satellite0 planet11 instrument0 image1)
   added: (have_image planet11 image1)
   goals met: 4 of 12
11. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 4 of 12
12. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 5 of 12
13. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 12
14. (take_image satellite0 phenomenon8 instrument0 image1)
   added: (have_image phenomenon8 image1)
   goals met: 6 of 12
15. (turn_to satellite0 planet5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet5)
   goals met: 6 of 12
16. (take_image satellite0 planet5 instrument0 image1)
   added: (have_image planet5 image1)
   goals met: 7 of 12
17. (turn_to satellite0 planet7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet7)
   goals met: 7 of 12
18. (take_image satellite0 planet7 instrument0 image1)
   added: (have_image planet7 image1)
   goals met: 8 of 12
19. (turn_to satellite0 star9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star9)
   goals met: 8 of 12
20. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 9 of 12
21. (turn_to satellite0 star6 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star6)
   goals met: 10 of 12
22. (take_image satellite0 star6 instrument0 image0)
   added: (have_image star6 image0)
   goals met: 11 of 12
23. (turn_to satellite5 planet13 star9)
   deleted: (pointing satellite5 star9)
   added: (pointing satellite5 planet13)
   goals met: 12 of 12
